Add mermaid diagrams
